IsValidDefaultFamilyType Method
 Identifies if this type is a valid default family type for the given family category id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsValidDefaultFamilyType(
	ElementId familyCategoryId
)
Visual Basic
Public Function IsValidDefaultFamilyType ( _
	familyCategoryId As ElementId _
) As Boolean
Visual C++
public:
bool IsValidDefaultFamilyType(
	ElementId^ familyCategoryId
)
Parameters
familyCategoryId
Type: Autodesk.Revit.DBElementId
 The family category id.
Return Value
 True if this type is a valid default family type for the given family category id.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
ElementType Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →